_posts/2019-06-27-extracting-files-from-dnf.html
---
layout: page
title: Extract package files from RPM
category: note
tags:
 - post
 - howto
 - linux
 - fedora
 - package-manager
 - dnf
---
<section id="outline-container-org780ecb0" class="outline-2">
<h2 id="org780ecb0"></h2>
<div class="outline-text-2" id="text-org780ecb0">
<p>
<code>dnf</code> &amp; <code>repoquery</code> don&rsquo;t provide ready faculties for extracting a file from a RPM package. You can do so without installing third-party software with <code>rpm2cpio</code> and <code>cpio</code>, which are distributed with Fedora Workstation &amp; RHEL.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">!/bin/</span><span style="color: #3a81c3; font-weight: bold;">bash</span>

<span style="color: #6c3163; font-weight: bold;">dnf_extract</span><span style="color: #3a81c3;">()</span> <span style="color: #3a81c3;">{</span>
    <span style="color: #715ab1;">pkg</span>=<span style="color: #2d9574;">"${1?Must supply package name}"</span>
    <span style="color: #715ab1;">file</span>=<span style="color: #2d9574;">"${2?Must supply file path}"</span>
    <span style="color: #715ab1;">tmpdir</span>=<span style="color: #2d9574;">"$(</span><span style="color: #6c3163;">mktemp</span><span style="color: #2d9574;"> -d)"</span>
    mkdir -p <span style="color: #2d9574;">"$tmpdir"</span>
    <span style="color: #6c3163;">(</span>
        <span style="color: #3a81c3;">cd</span> <span style="color: #2d9574;">"$tmpdir"</span> || <span style="color: #3a81c3; font-weight: bold;">exit</span> <span style="color: #4e3163;">3</span>
        <span style="color: #715ab1;">pkgname</span>=$<span style="color: #2d9574;">(</span><span style="color: #6c3163;">dnf</span> download --downloadonly <span style="color: #2d9574;">"$pkg"</span> --destdir=<span style="color: #2d9574;">"$tmpdir"</span> <span style="color: #2d9574;">\</span>
                      | tee &gt;<span style="color: #67b11d;">(</span>grep -o <span style="color: #2d9574;">'[^[:space:]]*.rpm'</span><span style="color: #67b11d;">)</span> <span style="color: #4e3163;">1</span>&gt;&amp;<span style="color: #4e3163;">2</span><span style="color: #2d9574;">)</span>
        rpm2cpio <span style="color: #2d9574;">"$pkgname"</span> | cpio -icvd <span style="color: #2d9574;">"*$file"</span>
        cat <span style="color: #2d9574;">"${file:1}"</span>
    <span style="color: #6c3163;">)</span>
    rm -r <span style="color: #2d9574;">"$tmpdir"</span>
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Which can be called with the package name and absolute file path:
</p>

<pre class="example" id="org62da0be">
$ dnf_extract bash-5.0.7-1.fc30.x86_64 /usr/share/licenses/bash/COPYING
</pre>
</div>
</section>
